#include "music.h"
#include "stm32f1xx_hal.h"

extern TIM_HandleTypeDef htim4;  // 蜂鸣器使用的定时器

/* 音乐数据：莫愁小姿 */
const Bate MoChouXiang[] = {
    // 我被困在了
    {M6, 1}, {M5, 1}, {M3, 1}, {M5, 0.5f}, {M5, 0.5f},
    // 这片混沌 柳暗
    {M6, 0.5f}, {M5, 1}, {M5, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M3, 0.5f},
    // 花明 一村一村一村
    {M2, 0.5f}, {M3, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M2, 0.5f}, {M3, 0.5f}, {M5, 0.5f}, {M3, 0.5f},
    // 一村又一村
    {M2, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {L7, 0.5f}, {M3, 1}, {M1, 1},
    // 不能理顺我
    {M2, 1}, {M3, 1}, {M2, 1}, {M3, 0.5f}, {M3, 0.5f},
    // 自己的疑问
    {M2, 0.5f}, {M3, 0.5f}, {M2, 0.5f}, {M5, 1.5f}, {M3, 1},
    // 病榻上传来了我微
    {M3, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M2, 0.5f}, {M2, 0.5f}, {M2, 0.5f}, {M2, 0.5f}, {M2, 0.5f},
    // 弱的呼吸声，没有啥大能
    {M1, 0.5f}, {M3, 0.5f}, {M1, 0.125f}, {M3, 0.125f}, {M5, 0.25f}, {M5, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M2, 0.5f}, {M3, 0.5f},
    // 耐，也无法忍受失
    {M5, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M2, 0.5f}, {M3, 0.5f}, {M5, 0.5f}, {M3, 0.5f},
    // 败 杀死人的从
    {M1, 0.5f}, {P0, 0.5f}, {P0, 0.5f}, {M5, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M2, 0.5f}, {M3, 0.5f},
    // 来不是挫折而是期
    {M5, 0.5f}, {M3, 0.5f}, {M2, 0.5f}, {M3, 0.5f}, {M2, 0.5f}, {M3, 0.5f}, {M5, 0.5f}, {M3, 0.5f},
    // 待 遏制住我发
    {M2, 1}, {P0, 0.5f}, {M5, 0.5f}, {M5, 0.5f}, {M6, 0.5f}, {M3, 0.5f}, {M5, 0.5f},
    // 疯 也没有让我太痛
    {M5, 0.5f}, {M1, 0.5f}, {M1, 0.5f}, {M1, 0.5f}, {M1, 0.5f}, {M5, 0.5f}, {M5, 0.5f}, {M3, 0.5f},
    // 快 噢 我茅塞顿
    {M2, 1}, {P0, 0.5f}, {M3, 0.5f}, {M2, 0.5f}, {M3, 0.5f}, {M2, 0.5f}, {M3, 0.5f},
    // 开 原来是自尊心在作
    {M2, 0.5f}, {M2, 0.5f}, {M2, 0.5f}, {M2, 0.5f}, {M3, 0.5f}, {M3, 0.25f}, {M3, 0.25f}, {M3, 0.5f}, {M2, 0.5f},
    // 怪 漏了一拍 我只能
    {M1, 0.5f}, {M5, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M5, 0.5f}, {M5, 0.5f}, {M5, 0.5f}, {M5, 0.5f},
    // 每天都把自己搞得很晕
    {M6, 0.5f}, {M5, 0.25f}, {M5, 0.25f}, {M5, 0.5f}, {M5, 0.25f}, {M5, 0.25f}, {M3, 0.25f}, {M5, 0.25f}, {M3, 0.5f}, {M5, 1},
    // 坏事降临头上也不清醒
    {M6, 0.5f}, {M5, 0.25f}, {M5, 0.25f}, {M5, 0.25f}, {M5, 0.25f}, {M5, 0.5f}, {M3, 0.25f}, {M5, 0.25f}, {M5, 0.5f}, {M3, 0.5f}, {M3, 0.5f},
    // 可笼罩在我头顶上的乌云
    {M2, 0.25f}, {M2, 0.25f}, {M2, 0.25f}, {M2, 0.25f}, {M2, 0.25f}, {M1, 0.25f}, {M1, 0.5f}, {M5, 0.25f}, {M5, 0.25f}, {M5, 0.5f}, {M5, 1},
    // 紧跟着逃不出她的手心
    {M2, 0.25f}, {M2, 0.25f}, {M2, 0.5f}, {M2, 0.25f}, {M1, 0.25f}, {M1, 0.5f}, {M5, 0.25f}, {M5, 0.25f}, {M3, 0.5f}, {M5, 1},
    // 呀 我的愁绪千
    {M1, 1}, {P0, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M2, 0.5f},
    // 丝万缕挥之不去
    {M1, 0.5f}, {M1, 0.5f}, {M1, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M2, 0.25f}, {M3, 0.25f}, {M2, 0.5f},
    // 闭上眼眼眶里下了场雨
    {M2, 0.25f}, {M2, 0.25f}, {M2, 0.5f}, {M2, 0.5f}, {M3, 0.25f}, {M2, 0.25f}, {M2, 0.25f}, {M2, 0.25f}, {M3, 0.5f}, {M2, 1},
    // 坠入了梦乡也弄湿了枕巾
    {M5, 0.5f}, {M5, 0.25f}, {M5, 0.25f}, {M5, 0.5f}, {M5, 0.25f}, {M5, 0.25f}, {M5, 0.25f}, {M6, 0.25f}, {M3, 0.5f}, {M5, 1},
    // 梦把我拽到个好地方 摇
    {M6, 0.5f}, {M5, 0.25f}, {M5, 0.25f}, {M5, 0.5f}, {M3, 0.25f}, {M3, 0.25f}, {M3, 0.5f}, {M5, 0.5f}, {M5, 0.5f}, {M5, 0.5f},
    // 摇晃晃到莫愁乡
    {M6, 0.5f}, {M5, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M5, 0.5f}, {M5, 1},
    // 炊烟漫过青瓦黛砖
    {M6, 0.5f}, {M5, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M5, 0.5f}, {M5, 0.5f}, {M5, 0.5f}, {M1, 0.5f},
    // 脚印伴随着微光 这
    {M1, 0.5f}, {M1, 0.5f}, {M1, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M2, 0.5f},
    // 伤 不痛不痒 她
    {M1, 1.5f}, {M5, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M2, 0.5f},
    // 讲 你在说谎 都是
    {M1, 1}, {P0, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M1, 0.25f}, {M1, 0.25f},
    // 装的坚强 你眼里
    {M3, 0.5f}, {M2, 1}, {M3, 0.5f}, {M2, 0.5f}, {M1, 0.5f}, {M1, 0.5f}, {M1, 0.5f},
    // 带着泪光 我
    {M3, 0.5f}, {M2, 1}, {M3, 0.5f}, {M2, 1.5f}, {M1, 0.5f},
    // 诉愁肠向莫愁乡 把
    {M6, 0.5f}, {M5, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M5, 0.5f}, {M5, 0.5f}, {M5, 0.5f},
    // 叹息吹成地上霜
    {M6, 0.5f}, {M5, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M5, 0.5f}, {M5, 1},
    // 明明快崩溃了 却还
    {M6, 0.5f}, {M5, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M1, 0.5f}, {M1, 0.5f},
    // 要乔装无关痛痒 墙
    {M1, 0.5f}, {M1, 0.5f}, {M1, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M2, 0.5f},
    // 边拨浪鼓叮当响 往
    {M1, 0.5f}, {M1, 0.5f}, {M1, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M2, 0.5f},
    // 我手心上放块儿糖
    {M1, 0.5f}, {M1, 0.5f}, {M1, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M2, 0.5f}, {M3, 0.5f},
    // 娃儿莫慌 姥姥
    {M3, 0.5f}, {M2, 1}, {M3, 0.5f}, {M2, 1}, {M1, 0.5f}, {M1, 0.5f},
    // 在边上 放声
    {M3, 0.5f}, {M2, 1}, {M3, 0.5f}, {M2, 1}, {M1, 0.5f}, {M1, 0.5f},
    // 大哭吧 这里没人
    {M5, 0.5f}, {P0, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M2, 0.5f}, {M3, 0.5f}, {M2, 0.5f}, {M3, 0.5f},
    // 会笑话你
    {M3, 0.5f}, {M2, 1}, {M1, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M3, 1},
    // 人生大事莫过生死
    {M5, 0.5f}, {M5, 0.5f}, {M6, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M5, 0.5f}, {M5, 0.5f}, {M3, 0.5f},
    // 其他都不要紧
    {M5, 0.5f}, {M5, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M1, 1},
    // 现实太要命了 让我
    {M1, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M2, 0.5f}, {M3, 0.5f}, {M1, 0.5f}, {M1, 0.5f}, {M1, 0.5f},
    // 时刻想要逃离
    {M1, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M2, 0.5f}, {M3, 1}, {M2, 0.5f}, {M3, 0.5f},
    // 可是 可是 转眼
    {M2, 0.5f}, {M2, 0.5f}, {M1, 0.5f}, {M2, 1}, {P0, 0.5f}, {M2, 0.5f}, {M2, 0.5f},
    // 间被闹钟叫醒
    {M1, 0.5f}, {M2, 0.5f}, {M3, 0.5f}, {M2, 0.5f}, {M3, 1}, {M1, 1},
    // 累了就出门溜达溜达
    {M6, 0.5f}, {M5, 0.25f}, {M5, 0.25f}, {M5, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M5, 0.5f},
    // 放心吧兜里够花够花
    {M6, 0.5f}, {M5, 0.25f}, {M5, 0.25f}, {M5, 0.25f}, {M5, 0.25f}, {M5, 0.5f}, {M3, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M5, 0.5f},
    // 我骗她是国企 我实际是牛马
    {M1, 0.25f}, {M1, 0.25f}, {M1, 0.25f}, {M1, 0.25f}, {M1, 0.25f}, {M1, 0.5f}, {M5, 0.25f}, {M5, 0.25f}, {M3, 0.25f}, {M3, 0.5f}, {M3, 0.25f}, {M2, 0.5f}, {M3, 0.5f},
    // 早九晚八五天年假
    {M1, 0.5f}, {M1, 0.5f}, {M1, 0.5f}, {M5, 0.5f}, {M2, 0.5f}, {M3, 0.5f}, {M2, 0.5f}, {M3, 0.5f},
    // 幺儿你在那边缺啥少啥
    {M6, 0.5f}, {M5, 0.25f}, {M5, 0.25f}, {M5, 0.25f}, {M5, 0.25f}, {M5, 0.5f}, {M3, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M5, 0.5f},
    // 有事没事都打个电话
    {M1, 0.5f}, {M1, 0.5f}, {M1, 0.5f}, {M3, 0.25f}, {M3, 0.25f}, {M3, 0.5f}, {M3, 0.5f}, {M2, 0.5f}, {M3, 0.5f},
    // 幺儿你到底啥时候回家
    {M2, 0.25f}, {M2, 0.25f}, {M2, 0.5f}, {M2, 0.5f}, {M2, 0.5f}, {M2, 0.25f}, {M3, 0.25f}, {M3, 0.5f}, {M3, 0.5f}, {M2, 0.5f},
    // 姥姥种的石榴开花了
    {M2, 0.5f}, {M2, 0.5f}, {M2, 0.5f}, {M2, 0.5f}, {M1, 0.25f}, {M1, 0.25f}, {M3, 0.5f}, {M3, 0.5f}, {M1, 0.5f},
    // 几度梦回莫愁乡 回
    {M6, 0.5f}, {M5, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M5, 0.5f}, {M5, 0.5f}, {M5, 0.5f},
    // 回梦的都不重样
    {M6, 0.5f}, {M5, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M5, 0.5f}, {M5, 1},
    // 纸飞机掠过操场后
    {M6, 0.5f}, {M5, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M1, 0.5f}, {M3, 0.5f},
    // 铁了心的要流浪
    {M1, 0.5f}, {M1, 0.5f}, {M1, 0.5f}, {M5, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M2, 0.5f}, {M3, 0.5f},
    // 哪管前路几多长
    {M1, 0.5f}, {M1, 0.5f}, {M1, 0.5f}, {M5, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M2, 0.5f}, {M3, 0.5f},
    // 偏信远方有朝阳
    {M1, 0.5f}, {M1, 0.5f}, {M1, 0.5f}, {M5, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M2, 0.5f}, {M3, 0.5f},
    // 却输岁月半柱香
    {M3, 0.5f}, {M2, 0.5f}, {M2, 0.5f}, {M3, 0.5f}, {M2, 0.5f}, {M3, 0.5f}, {M2, 1},
    // 人走茶凉
    {M3, 0.5f}, {M2, 1}, {M3, 0.5f}, {M2, 1}, {M1, 1},
    // 几度梦回莫愁乡 旧
    {M6, 0.5f}, {M5, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M5, 0.5f}, {M5, 0.5f}, {M5, 0.5f},
    // 木船飘向芦苇荡
    {M6, 0.5f}, {M5, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M5, 0.5f}, {M5, 1},
    // 载着未寄出的信 还
    {M6, 0.5f}, {M5, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M1, 0.5f},
    //有糖纸染上的香
    {M1, 0.5f}, {M1, 0.5f}, {M1, 0.5f}, {M5, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M2, 0.5f}, {M3, 0.5f},
    // 摇 摇摇晃晃
    {M1, 1}, {P0, 0.5f}, {M5, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M2, 0.5f}, {M3, 0.5f},
    // 飘 飘飘荡荡
    {M1, 1}, {P0, 0.5f}, {M5, 0.5f}, {M5, 0.5f}, {M3, 0.5f}, {M2, 0.5f}, {M3, 0.5f},
    // 娃儿抬头望
    {M3, 0.5f}, {M2, 0.5f}, {M2, 0.5f}, {M3, 0.5f}, {M3, 0.5f}, {M2, 1.5f},
    // 姥姥在天上
    {M1, 0.5f}, {M3, 0.5f}, {M2, 0.5f}, {M3, 0.5f}, {M2, 1}, {M1, 1},
};

/* 音乐播放状态变量 */
static uint8_t music_playing = 0;
static size_t music_index = 0;
static float noteDurationMs = 0.0f;
static uint32_t music_next_tick = 0;

uint32_t TIM_GetCounterFreq(TIM_HandleTypeDef *htim) {
    uint32_t timer_clock;
    // 高级定时器是APB2
    if (htim->Instance == TIM1) {
        timer_clock = HAL_RCC_GetPCLK2Freq();
        // 如果APB分频不为1，定时器时钟会翻倍
        if (HAL_RCC_GetPCLK2Freq() != (HAL_RCC_GetHCLKFreq() / 1)) {
            timer_clock *= 2;
        }
    } else {
        // 其他定时器是APB1
        timer_clock = HAL_RCC_GetPCLK1Freq();
        // 如果APB分频不为1，定时器时钟会翻倍
        if (HAL_RCC_GetPCLK1Freq() != (HAL_RCC_GetHCLKFreq() / 1)) {
            timer_clock *= 2;
        }
    }

    uint32_t prescaler = htim->Instance->PSC;
    return timer_clock / (prescaler + 1);
}

void init_music(void) {
    HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_4);
    music_playing = 0;
    music_index = 0;
    music_next_tick = 0;
    noteDurationMs = 1000.0f * 60.0f / 132.0f;
}

void start_music(void)
{
    if (!music_playing)
    {
        music_playing = 1;
        music_index = 0;
        music_next_tick = 0;
        HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_4);
    }
}

void stop_music(void)
{
    music_playing = 0;
    music_index = 0;
    music_next_tick = 0;
    __HAL_TIM_SET_COMPARE(&htim4, TIM_CHANNEL_4, 0);
    HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_4);
}

void play_music(void) {
    if (!music_playing) {
        return;
    }

    uint32_t now = HAL_GetTick();
    uint32_t timFrequency = TIM_GetCounterFreq(&htim4);

    if (music_next_tick == 0 || now >= music_next_tick)
    {
        const Bate bate = MoChouXiang[music_index];

        if (bate.frequency == P0)
        {
            __HAL_TIM_SET_COMPARE(&htim4, TIM_CHANNEL_4, 0);
        }
        else
        {
            uint32_t arr = timFrequency / bate.frequency;
            if (arr == 0) {
                arr = 1;
            }
            __HAL_TIM_SET_AUTORELOAD(&htim4, arr);
            __HAL_TIM_SET_COMPARE(&htim4, TIM_CHANNEL_4, arr / 5);
            __HAL_TIM_SetCounter(&htim4, 0);
        }

        music_next_tick = now + (uint32_t)(bate.period * noteDurationMs);
        music_index++;
        if (music_index >= (sizeof(MoChouXiang) / sizeof(MoChouXiang[0])))
        {
            music_index = 0;
        }
    }
}
